# Taps
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "nicoverbruggen/homebrew-cask"
tap "homebrew/services"

# Binaries
brew "awscli"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "gnupg" # GPG signing in Fork
brew "grep"
brew "htop"
brew "httpie"
brew "jq"
brew "mackup"
brew "mas" # Mac App Store manager
brew "mkcert"
brew "multitail"
brew "nano"
brew "nss" # Needed by mkcert for Firefox support
brew "pinentry-mac" # GPG signing in Fork
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "pygments"
brew "svn" # Needed to install fonts
brew "telnet"
brew "watch"
brew "yt-dlp" # Download m3u streams

# Development
brew "composer"
brew "mariadb"
brew "nginx"
brew "nvm"
brew "php"
brew "pnpm"
brew "yarn"

# Apps
cask "1password"
cask "alfred"
cask "appcleaner"
cask "balsamiq-wireframes"
cask "brave-browser"
cask "caret"
cask "chromium"
cask "coconutbattery"
cask "codewhisperer"
cask "cyberduck"
cask "dbeaver-community"
cask "docker"
cask "figma"
cask "firefox-developer-edition"
cask "fontbase"
cask "fork"
cask "gpg-suite-no-mail"
cask "grammarly-desktop"
cask "handbrake"
# cask "helo" # Nice but paid
# cask "hiddenbar" # installed via mas from App Store
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "libreoffice"
cask "lunar"
cask "mongodb-compass"
cask "microsoft-teams"
cask "microsoft-office"
cask "miro"
cask "netspot"
cask "notion"
cask "obs"
cask "openvpn-connect"
cask "origami-studio"
cask "phpmon"
cask "poedit"
cask "postman"
cask "principle"
cask "shottr"
cask "sketch"
cask "spotify"
cask "steam"
cask "suspicious-package"
cask "sublime-text"
cask "tableplus"
cask "telegram-desktop"
cask "teamviewer"
cask "vlc"

# Quicklook
cask "apparency"
cask "provisionql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "suspicious-package"
cask "webpquicklook"

# Fonts
cask "font-jetbrains-mono"

# Mac App Store
mas "Xcode", id: 497799835
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Gifski", id: 1351639930
mas "Lightweight PDF", id: 1450640351
mas "System Designer", id: 1102494854
mas "AmorphousDiskMark", id: 1168254295
mas "Cinebench", id: 1438772273
mas "HEIC Converter", id: 1294126402
# mas "Lockdown Privacy - Desktop", id: 1483255076
mas "Magnet", id: 441258766
mas "HP Easy Scan", id: 967004861
mas "rcmd • App Switcher", id: 1596283165
mas "Slack for Desktop", id: 803453959
mas "Spark – Email App by Readdle", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Hidden Bar", id: 1452453066

# Manual installs
#
# pCloud Drive - https://www.pcloud.com/download-free-online-cloud-file-storage.html
# HP Envy 5000 drivers - https://support.hp.com/nl-nl/drivers/selfservice/hp-envy-5000-all-in-one-printer-series/14095644
# Clockify Time Tracker - https://clockify.me/mac-time-tracking
# http-server - npm i -g http-server
